{
  "posts": [
    {
      "id": "6",
      "recipe": "Chicken Tikka Masala",
      "ingredients": "1 1/2 pounds boneless, skinless chicken breasts. 1/2 cup plain yogurt. 2 tablespoons lemon juice. 2 tablespoons ghee or vegetable oil. 2 cloves garlic, minced. 1 teaspoon ground cumin. 1 teaspoon smoked paprika. 1/2 teaspoon ground cinnamon. 1/2 teaspoon ground cardamom. 1/4 teaspoon cayenne pepper. 1 can diced tomatoes. 1 cup chicken broth. Salt and pepper, to taste.",
      "cookinginstruction": "Cut the chicken into bite-sized pieces and marinate in the yogurt, lemon juice, and spices for at least 30 minutes. Heat the ghee or oil in a large skillet over medium-high heat. Add the chicken and cook until browned, about 5-6 minutes. Add the diced tomatoes and chicken broth and bring to a boil. Reduce heat to low and simmer for 10 minutes. Serve over rice.",
      "images": "chickentikkamasala"
    },
    
    {
      "id": "7",
      "recipe": "Shrimp Scampi",
      "ingredients": "1 pound large shrimp, peeled and deveined. 4 tablespoons butter. 2 cloves garlic, minced. 1/4 cup white wine. 1/4 cup freshly squeezed lemon juice. 1/4 cup chopped fresh parsley. Salt and pepper, to taste. 1/2 cup cooked linguine.",
      "cookinginstruction": "Melt the butter in a large skillet over medium-high heat. Add the garlic and cook for 1 minute. Add the shrimp and cook until pink, about 2-3 minutes. Add the white wine, lemon juice, and parsley. Cook for 1-2 minutes. Serve over linguine.",
      "images": "shrimp scampi"
    },
    
    {
      "id": "8",
      "recipe": "Chicken Quesadillas",
      "ingredients": "1 pound boneless, skinless chicken breasts. 1/2 cup chopped onion. 1/2 cup chopped bell pepper. 1 jalapeno pepper, chopped. 2 cloves garlic, minced. 1 cup shredded cheese. 4 large tortillas. Salt and pepper, to taste.",
      "cookinginstruction": "Cook the chicken, onion, bell pepper, jalapeno pepper, and garlic in a skillet over medium-high heat until the chicken is cooked through. Add the cheese and stir until melted. Divide the mixture among the tortillas and fold in half. Cook in a skillet over medium heat until browned and crispy.",
      "images": "chickenquesadillas"
    },
    
    {
      "id": "9",
      "recipe": "Meatball Subs",
      "ingredients": "1 pound ground beef. 1/2 cup breadcrumbs. 1 egg. 1/4 cup chopped onion. 2 cloves garlic, minced. 1 cup marinara sauce. 4 sub rolls. Provolone cheese, sliced.",
      "cookinginstruction": "Combine the ground beef, breadcrumbs, egg, onion, and garlic in a bowl and mix until well combined. Form into meatballs and cook in a skillet over medium-high heat until browned. Add the marinara sauce and simmer for 10 minutes. Serve on sub rolls with provolone cheese.",
      "images": "meatballsubs"
    },
    
    {
      "id": "10",
      "recipe": "Chicken Fettuccine Alfredo",
      "ingredients": "1 pound boneless, skinless chicken breasts. 1 cup fettuccine. 2 tablespoons butter. 2 cloves garlic, minced. 1 cup heavy cream. 1 cup grated Parmesan cheese. Salt and pepper, to taste.",
      "cookinginstruction": "Cook the fettuccine according to package instructions. Cook the chicken in a skillet over medium-high heat until browned. Add the butter and garlic and cook for 1 minute. Add the heavy cream and Parmesan cheese and simmer for 5 minutes. Serve over fettuccine.",
      "images": "chickenfettuccinealfredo"
    },
    
    {
      "id": "11",
      "recipe": "Beef Tacos",
      "ingredients": "1 pound ground beef. 1/2 cup chopped onion. 1/2 cup chopped bell pepper. 2 cloves garlic, minced. 1 packet taco seasoning. 8-10 taco shells. Shredded cheese. Lettuce. Diced tomatoes.",
      "cookinginstruction": "Cook the ground beef, onion, bell pepper, and garlic in a skillet over medium-high heat until the beef is browned. Add the  taco seasoning and simmer for 10 minutes. Serve in tthe taco seasoning and simaco shells with cheesemer for 5 minutes. Ser, lettuce, and dve in taco shells withiced tomatoes.",
    "images":"chickenfettuccinealfredo"
    },
    { "id": "13", "recipe": "Chili", "ingredients": "1 pound ground beef. 1/2 cup chopped onion. 1/2 cup chopped bell pepper. 2 cloves garlic, minced. 1 can kidney beans. 1 can diced tomatoes. 1 can tomato sauce. 1 tablespoon chili powder. Salt and pepper, to taste.", "cookinginstruction": "Cook the ground beef, onion, bell pepper, and garlic in a skillet over medium-high heat until the beef is browned. Add the kidney beans, diced tomatoes, tomato sauce, chili powder, salt, and pepper. Simmer for 30 minutes.", "images": "chili" },


    { "id": "14", "recipe": "Spaghetti and Meatballs", "ingredients": "1 pound ground beef. 1/2 cup breadcrumbs. 1 egg. 1/4 cup chopped onion. 2 cloves garlic, minced. 1 cup marinara sauce. 4 servings spaghetti. Grated Parmesan cheese, for serving.", "cookinginstruction": "Preheat oven to 350째F. Combine the ground beef, breadcrumbs, egg, onion, and garlic in a bowl and mix until well combined. Form into meatballs and arrange on a baking sheet. Bake for 20 minutes. Heat the marinara sauce in a skillet over medium-high heat. Add the cooked meatballs and simmer for 10 minutes. Serve over spaghetti with grated Parmesan cheese.", "images": "spaghettiandmeatballs" },

{ "id": "15", "recipe": "BBQ Chicken Pizza", "ingredients": "1 pound boneless, skinless chicken breasts. 1 pre-made pizza crust. 1/2 cup barbecue sauce. 1 cup shredded mozzarella cheese. 1/4 cup chopped red onion. 1/4 cup chopped cilantro.", "cookinginstruction": "Cook the chicken in a skillet over medium-high heat until browned. Slice and set aside. Preheat oven to 425째F. Spread the barbecue sauce over the pizza crust. Top with the sliced chicken, mozzarella cheese, red onion, and cilantro. Bake for 10-12 minutes.", "images": "bbqchickenpizza" },

{ "id": "16", "recipe": "Vegetable Fried Rice", "ingredients": "1 cup cooked rice. 1/2 cup chopped carrots. 1/2 cup chopped broccoli. 1/2 cup chopped bell pepper. 1/2 cup chopped onion. 2 cloves garlic, minced. 2 tablespoons vegetable oil. 2 tablespoons soy sauce. Salt and pepper, to taste.", "cookinginstruction": "Heat the vegetable oil in a skillet over medium-high heat. Add the carrots, broccoli, bell pepper, onion, and garlic. Cook until the vegetables are tender. Add the rice, soy sauce, salt, and pepper. Stir to combine and cook for 5 minutes.", "images": "vegetablefriedrice" },

{ "id": "17", "recipe": "Grilled Steak Tacos", "ingredients": "1 pound flank steak. 1/4 cup olive oil. 1/4 cup lime juice. 2 cloves garlic, minced. 1/4 cup chopped cilantro. Salt and pepper, to taste. 8-10 small flour tortillas. Shredded lettuce. Diced tomatoes. Shredded cheese. Guacamole, for serving.", "cookinginstruction": "Marinate the flank steak in the olive oil, lime juice, garlic, cilantro, salt, and pepper for at least 30 minutes. Preheat grill to medium-high heat. Grill the flank steak for 5-6 minutes on each side. Let rest for 5 minutes and then slice thinly. Serve on small flour tortillas with lettuce, tomatoes, cheese, and guacamole.", "images": "grilledsteaktacos" },

{ "id": "18", "recipe": "Stuffed Peppers", "ingredients": "4 bell peppers. 1 pound ground beef. 1/2 cup cooked rice. 1/2 cup chopped onion. 2 cloves garlic, minced. 1 can diced tomatoes. 1 cup shredded cheddar cheese. Salt and pepper, to taste.", "cookinginstruction": "Preheat oven to 350째F. Cut off the tops of the bell peppers and remove the membranes and seeds. Cook the ground beef, onion, and garlic in a skillet over medium-high heat until the beef is browned. Add the rice, diced tomatoes, salt, and pepper. Stuff the bell peppers with the beef and rice mixture and top with shredded cheddar cheese. Bake for 25-30 minutes.", "images": "stuffedpeppers" },

{ "id": "19", "recipe": "Baked Ziti with Meat Sauce", "ingredients": "1 pound ground beef. 1/2 cup chopped onion. 1/2 cup chopped bell pepper. 2 cloves garlic, minced. 1 can diced tomatoes. 1 can tomato sauce. 1 tablespoon dried basil. 1 tablespoon dried oregano. Salt and pepper, to taste. 8 ounces ziti. 1 1/2 cups shredded mozzarella cheese.", "cookinginstruction": "Preheat oven to 350째F. Cook the ground beef, onion, bell pepper, and garlic in a skillet over medium-high heat until the beef is browned. Add the diced tomatoes, tomato sauce, basil, oregano, salt, and pepper. Simmer for 10 minutes. Cook the ziti according to package instructions. Combine the cooked ziti and meat sauce. Transfer to a baking dish and top with mozzarella cheese. Bake for 20-25 minutes.", "images": "bakedzitiwithmeat" },

{ "id": "20", "recipe": "Salisbury Steak", "ingredients": "1 pound ground beef. 1/4 cup breadcrumbs. 1 egg. 2 tablespoons chopped onion. 1 tablespoon Worcestershire sauce. Salt and pepper, to taste. 1 cup mushrooms, sliced. 1/2 cup beef broth. 1/2 cup red wine. 1 tablespoon ketchup. 1 tablespoon all-purpose flour.", "cookinginstruction": "Preheat a skillet over medium-high heat. Combine the ground beef, breadcrumbs, egg, onion, Worcestershire sauce, salt, and pepper. Form into patties and cook in the skillet for 3-4 minutes on each side. Remove from skillet and keep warm. Add the mushrooms to the skillet and cook until tender. Add the beef broth, red wine, ketchup, and flour. Cook until thickened. Serve the steaks topped with the sauce.", "images": "salisburysteak" },


  ]
}